Enter the base and height of a triangle:
45
80
The area of triangle with base=45.000000 and height=80.000000 is 1800.000000
îº§ gdb ./a.out;
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x877: file p6final.c, line 22.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:22
22  {
(gdb) s
23    Triangle t = input_triangle();
(gdb) s
input_triangle () at p6final.c:7
7   {
(gdb) s
9     printf("Enter the base and height of a triangle:\n");
(gdb) n
Enter the base and height of a triangle:
10    scanf("%f%f", &t.base, &t.height);
(gdb) n
45
80
11    return t;
(gdb) n
12  }
(gdb) n
main () at p6final.c:24
24    area(&t);
(gdb) s
area (t=0x7fffcdce633c) at p6final.c:15
15    t->area = 0.5 * t->base * t->height;
(gdb) n
16  }
(gdb) n
main () at p6final.c:25
25    output(t);
(gdb) s
output (t=...) at p6final.c:19
19    printf("The area of triangle with base=%f and height=%f is %f\n", t.base, t.height, t.area);
(gdb) n
The area of triangle with base=45.000000 and height=80.000000 is 1800.000000
20  }
(gdb) n
main () at p6final.c:26
26    return 0;
(gdb) n
27  }
(gdb) continue
Continuing.
[Inferior 1 (process 1476) exited normally]
(gdb) p
The history is empty.
(gdb) c
The program is not being run.
(gdb) l
22  {
23    Triangle t = input_triangle();
24    area(&t);
25    output(t);
26    return 0;
27  }
(gdb) 